pibg_fyp/app/Controllers/Auth.php

                function checkParent(){   //login for parent

                        $validation = $this->validate([
                                'email'=>[
                                        'rules'=>'required|valid_email|is_not_unique[tbl_parent.fld_email]',
                                        'errors'=>[
                                                'required'=>'Email is required',
                                                'valid_email'=>'Enter a valid email address',
                                                'is_not_unique'=>'This email is not registered'
                                        ]
                                        ],
                                'password'=>[
                                        'rules'=>'required|min_length[5]|max_length[12]',
                                        'errors'=>[
                                                'required'=>'Password is required',
                                                'min_length'=>'Password must have at least 5 characters in length',
                                                'max_length'=>'Password must not have characters more than 12 in length'
                                        ]
                                        ]
                        ]);


                        if(!$validation){
                                return view('auth/login',['validation'=>$this->validator]);
                        }else{

                                $email = $this->request->getPost('email');
                                $password = $this->request->getPost('password');
                                $usersModel = new \App\Models\ParentModel();
                                $user_info = $usersModel->where('fld_email',$email)->first();
---
SELECT *
FROM `tbl_parent`
WHERE `fld_email` = 'andy@gmail.com'
 LIMIT 1