pibg_fyp/app/Controllers/UserController.php

SELECT *
FROM `tbl_teacher`
SELECT *
FROM `tbl_result`
SELECT *
FROM `tbl_crowdfunding`
SELECT *
FROM `tbl_activity`
---
    public function index()
    {


        // $parentModel = new \App\Models\ParentModel();  //parents
        // $parentInfo = $parentModel->findAll();

        $teacherModel = new \App\Models\UsersModel(); // teachers
        $teacherInfo = $teacherModel->findAll();
        $totalTeacher = count($teacherInfo);

        $resultModel = new \App\Models\ResultModel();  //children results
        $resultInfo = $resultModel->findAll();

        $crowdfundingModel = new \App\Models\CrowdfundingModel();  //children results
        $crowdfundingInfo = $crowdfundingModel->findAll();

        $activityModel = new \App\Models\ActivityModel();  // all activities
        $activityInfo = $activityModel->findAll();

SELECT *
FROM `tbl_activity`
SELECT *
FROM `tbl_participant`
---
    public function activity()
    {
        $activityModel = new \App\Models\ActivityModel();
        $data['activities'] = $activityModel->findAll();

        $participantModel = new \App\Models\ParticipantModel();
        $participantInfo = $participantModel->findAll();

SELECT *
FROM `tbl_result`
---
    public function result()
    {
        $parentModel = new \App\Models\ParentModel();
        $resultModel = new \App\Models\ResultModel();
        $studentModel = new \App\Models\StudentModel();

        $loggedUserID = session()->get('loggedUser');
        $userInfo = $parentModel->find($loggedUserID);
        $resultInfo = $resultModel->findAll();

SELECT *
FROM `tbl_activity`
SELECT *
FROM `tbl_crowdfunding`
WHERE `fld_pid` = '1'
---
    public function crowdfunding()
    {
        $activityModel = new \App\Models\ActivityModel();
        $activityInfo = $activityModel->findAll();

        $crowdfundingModel = new \App\Models\crowdfundingModel();
        //$crowdfundingInfo = $crowdfundingModel->findAll();

        $parentModel = new \App\Models\ParentModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $parentModel->find($loggedUserID);

        $crowdfundingInfo = $crowdfundingModel->where('fld_pid', $loggedUserID)->findAll();

SELECT *
FROM `tbl_teacher`
---
    public function viewTeacher()
    {
        $parentModel = new \App\Models\ParentModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $parentModel->find($loggedUserID);

        $teacherModel = new \App\Models\UsersModel();
        $teacherInfo = $teacherModel->findAll();